In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'Country':['China','China', 'India', 'India', 'America', 'Japan', 'China', 'India'], 
                   'Income':[10000, 10000, 5000, 5002, 40000, 50000, 8000, 5000],
                    'Age':[5000, 4321, 1234, 4010, 250, 250, 4500, 4321]})

In [3]:
df

   Country  Income   Age
0    China   10000  5000
1    China   10000  4321
2    India    5000  1234
3    India    5002  4010
4  America   40000   250
5    Japan   50000   250
6    China    8000  4500
7    India    5000  4321

In [5]:
df_gb = df.groupby('Country')
df_gb

In [7]:
for index, data in df_gb:
    print(index)
    print("*******************")
    print(data)

America
*******************
   Country  Income  Age
4  America   40000  250
China
*******************
  Country  Income   Age
0   China   10000  5000
1   China   10000  4321
6   China    8000  4500
India
*******************
  Country  Income   Age
2   India    5000  1234
3   India    5002  4010
7   India    5000  4321
Japan
*******************
  Country  Income  Age
5   Japan   50000  250

In [9]:
df_agg = df.groupby('Country').agg(['min', 'mean', 'max'])
df_agg

        Income                        Age
           min          mean    max   min         mean   max
Country
America  40000  40000.000000  40000   250   250.000000   250
China     8000   9333.333333  10000  4321  4607.000000  5000
India     5000   5000.666667   5002  1234  3188.333333  4321
Japan    50000  50000.000000  50000   250   250.000000   250

In [ ]:
gp = df.groupby('Brand')
gp

In [ ]:
#gp只是临时存储
gp.count()

In [ ]:
gp.count().index